[
  {
    "q": "When is Hollow Knight: Silksong being released?",
    "a": "Hollow Knight: Silksong is scheduled to release on September 4, 2025. The game will be available simultaneously across all confirmed platforms."
  },
  {
    "q": "Will Hollow Knight: Silksong be available on Xbox Game Pass?",
    "a": "Yes, Hollow Knight: Silksong will be available on Xbox Game Pass and PC Game Pass from Day One of its release. This was officially announced during the Xbox Games Showcase 2022."
  },
  {
    "q": "What platforms will Hollow Knight: Silksong be available on?",
    "a": "Hollow Knight: Silksong is confirmed for PC (Steam, GOG), Xbox Series X/S, Xbox One, PlayStation 5, PlayStation 4, Nintendo Switch, and will be available on Xbox Game Pass. Additional platforms may be announced closer to release."
  },
  {
    "q": "Do I need to play the original Hollow Knight before Silksong?",
    "a": "While Hollow Knight: Silksong is a sequel, it features Hornet as the protagonist and takes place in the Kingdom of Pharloom, making it accessible to new players. However, playing the original Hollow Knight will provide valuable context and enhance your understanding of the world and characters."
  },
  {
    "q": "How is Silksong different from the original Hollow Knight?",
    "a": "Silksong features Hornet as the playable character with needle and thread-based combat, a new kingdom (Pharloom) to explore, over 150 new enemies, a Tools system replacing Charms, silk-based abilities instead of Soul magic, and faster-paced aerial combat mechanics."
  },
  {
    "q": "Will there be any DLC or additional content for Silksong?",
    "a": "Team Cherry has not announced any DLC plans for Hollow Knight: Silksong. The team is currently focused on delivering the complete base game experience."
  },
  {
    "q": "Can I pre-order Hollow Knight: Silksong?",
    "a": "Pre-orders are not yet available for Hollow Knight: Silksong. You can add the game to your wishlist on Steam and other digital platforms to be notified when pre-orders become available."
  }
]